app/models/bitcoin.rb

  def self.instance
    Cryptocurrency.where(name: "BTC").first_or_create do |crypto|
---
SELECT `cryptocurrencies`.* FROM `cryptocurrencies` WHERE `cryptocurrencies`.`name` = 'BTC' ORDER BY `cryptocurrencies`.`id` ASC LIMIT 1