app/models/ethereum.rb

  def self.instance
    Cryptocurrency.where(name: "ETH").first_or_create do |crypto|
---
SELECT `cryptocurrencies`.* FROM `cryptocurrencies` WHERE `cryptocurrencies`.`name` = 'ETH' ORDER BY `cryptocurrencies`.`id` ASC LIMIT 1